{
  "backend/main.mo": "Main actor for the Christmas Channel radio station backend, defining data types (DJProfile, Program, ProgramDaySlot, ThemeSettings, etc.) and state variables, with access-controlled query/update endpoints for managing DJs, programs, now-playing, weather, song requests, and station info.",
  "backend/migration.mo": "Data migration module that transforms the old flat `programSchedule` map (keyed by program name to a single Program) into the new format (keyed to an array of ProgramDaySlots covering Monday–Friday).",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—weekday-aware ManagePrograms admin page and weekday-grouped public SchedulePage—to their relevant source files and test IDs.",
  "frontend-file-summaries.txt": "Text file containing short summaries of each frontend source file, describing their roles and notable changes such as updated React Query hooks for the new ProgramDaySlot backend format.",
  "frontend/index.html": "HTML entry point for the React frontend, setting the page title to 'The Christmas Channel Radio Station Website' and mounting the app at the `#root` div.",
  "frontend/src/App.tsx": "Root React application component that configures TanStack Router with all public and admin routes, wraps the app in QueryClient and ThemeProvider, and includes global components like ProfileSetup and InitializeDJProfiles.",
  "frontend/src/components/ChristmasCountdown.tsx": "Countdown timer component that calculates and displays days, hours, minutes, and seconds remaining until December 25th of the current year, updating every second.",
  "frontend/src/components/Footer.tsx": "Site footer component displaying station description, quick navigation links, and social media icon links (Facebook, X, Instagram) with a caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, nav links (including conditional Admin link), and Internet Identity login/logout button. Handles mobile menu toggle and active route highlighting.",
  "frontend/src/components/InitializeDJProfiles.tsx": "Headless component that runs once on mount to seed a default DJ profile (Mark Huotari) if it doesn't exist and clears the now-playing state.",
  "frontend/src/components/LastPlayed.tsx": "Card component that embeds a Live365 iframe showing recently played songs for station a76054.",
  "frontend/src/components/Layout.tsx": "Root layout wrapping all pages with a theme-aware background image, decorative Christmas overlays, snowflakes, Header, Footer, and a router Outlet.",
  "frontend/src/components/NowPlaying.tsx": "Card displaying the currently playing song fetched from the backend, plus an embedded Live365 radio player iframe.",
  "frontend/src/components/OnAirDisplay.tsx": "Card that determines and displays the current on-air program by matching the current day/time against the fetched schedule slots, with override support and Auto DJ fallback.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog that prompts newly authenticated users to enter their display name, then saves it via the backend mutation.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard that blocks access to children unless the user is authenticated and confirmed as an admin, showing appropriate login or access-denied UI otherwise.",
  "frontend/src/components/PublicWeatherForecast.tsx": "Displays a 7-day weather forecast for Duluth, MN by fetching data from the Open-Meteo API, showing weather icons, temperature ranges, and descriptions. Refreshes data every 24 hours and always uses Fahrenheit.",
  "frontend/src/components/RadioPlayer.tsx": "An audio player component for a Christmas radio stream with play/pause and volume controls including a mute toggle and slider. Uses a placeholder stream URL and an HTML audio element via a React ref.",
  "frontend/src/components/ScrollingBanner.tsx": "Renders a horizontally scrolling marquee banner with a Christmas-themed gradient promoting The Christmas Channel on Live365.",
  "frontend/src/components/Snowflakes.tsx": "Generates and renders animated falling snowflakes and randomly positioned twinkling colored lights as fixed full-screen decorative overlays. Uses randomized positions, sizes, and animation timings.",
  "frontend/src/components/UpcomingShows.tsx": "Fetches the program schedule and displays the next upcoming live shows (excluding Auto DJ) with time-until labels by computing offsets from the current day and time. Includes loading skeletons and day-matching logic for daily, weekday, weekend, and range patterns.",
  "frontend/src/components/WaysToListen.tsx": "Displays a grid of cards listing five ways to listen to The Christmas Channel (website, Live365, Radioline, Online Radio Box, Get Me Radio) with icons, descriptions, and action buttons that open external links or scroll to the top.",
  "frontend/src/components/WeatherWidget.tsx": "An admin-facing 7-day weather widget for Duluth, MN using the Open-Meteo API, similar to PublicWeatherForecast but adds a Fahrenheit/Celsius toggle and refreshes when the unit preference changes.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, status flags, and login/clear functions to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data fetching and mutations (DJ profiles, schedule, now playing, theme settings, user profile, song requests, etc.), each gated on actor availability.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines a Christmas-themed color palette with CSS variables for light and dark modes, custom scrollbar styles, and a snowflake fall animation.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/AboutPage.tsx": "About page displaying station information, a mission description, and a feature grid with Christmas-themed styling, loading station info dynamically via the useGetStationInformation query hook.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Protected admin dashboard that provides a manual data-refresh trigger with status display, a weather widget, and a grid of navigation cards linking to each management section of the station.",
  "frontend/src/pages/admin/ManageDJs.tsx": "Protected admin page for CRUD management of DJ profiles, featuring a dialog form with image file upload (with progress tracking) and confirmation dialogs for deletion.",
  "frontend/src/pages/admin/ManageNowPlaying.tsx": "Admin page for updating or clearing the currently playing song, with a form for title and artist fields backed by React Query mutations.",
  "frontend/src/pages/admin/ManageOnAir.tsx": "Admin page to manually set or clear an 'On Air' display override, specifying a show name, description, and duration in hours.",
  "frontend/src/pages/admin/ManagePrograms.tsx": "Admin page for managing the program schedule, supporting add, edit, and delete operations on program day slots via a dialog form.",
  "frontend/src/pages/admin/ManageSongRequests.tsx": "Admin page that displays incoming listener song requests in a table and allows bulk deletion of all requests with a confirmation dialog.",
  "frontend/src/pages/admin/ManageStationInfo.tsx": "Admin page for editing the station's About section, including title, description, and content fields, saved via a React Query mutation.",
  "frontend/src/pages/admin/ManageThemeSettings.tsx": "Admin page component for managing site theme settings including background image, primary/accent colors, snow effect, countdown, and news feed toggles. Loads existing settings via query hook and saves updates with preview mode support.",
  "frontend/src/pages/DJsPage.tsx": "DJs page that fetches and displays DJ profiles in a responsive grid with photos and bios, showing skeleton loaders while fetching and an empty state if no DJs exist.",
  "frontend/src/pages/HomePage.tsx": "The main public-facing home page that composes the hero banner, Christmas countdown, radio player, now playing, on-air display, last played, upcoming shows, weather forecast, ways to listen, and quick-link cards into a single layout.",
  "frontend/src/pages/RequestsPage.tsx": "A public page with a form that lets listeners submit song requests (name, song title, optional message) via the useSubmitSongRequest mutation, showing success/error toasts on completion.",
  "frontend/src/pages/SchedulePage.tsx": "Displays the weekly program schedule grouped and sorted by day, with color-coded day cards, a quick-nav pill bar, today highlighting, and skeleton loading states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens (including Christmas-themed colors), border radius, box shadow, animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state metadata for a Program Schedule app, tracking existing features (weekday program slot management and public schedule display) and pending feature requests (backend data model updates for weekday-specific program slots)."
}