{
  "backend/main.mo": "Main actor for the Christmas Channel radio station backend, defining data types (DJProfile, Program with bio field, NowPlaying, ThemeSettings, etc.) and managing state for DJ profiles, program schedules, song requests, weather data, and on-air overrides with authorization via access control mixins.",
  "backend/migration.mo": "Data migration module that upgrades the program schedule from the old Program type (without bio) to the new type (with bio defaulting to empty string), preserving all other actor state.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features—adding a bio field to ManagePrograms, displaying show bios on SchedulePage, and showing bios in UpcomingShows—to their respective files and test IDs.",
  "frontend-file-summaries.txt": "Text file containing short summaries of each frontend source file, describing their roles and notable changes such as bio field additions and component updates.",
  "frontend/index.html": "Root HTML entry point for the React app, setting the page title to 'The Christmas Channel Radio Station Website' and mounting the app at the #root div.",
  "frontend/src/App.tsx": "Main React application component that sets up TanStack Router with all page routes (public and admin), wraps the app in QueryClient and ThemeProvider, and renders the root layout with ProfileSetup and InitializeDJProfiles.",
  "frontend/src/components/ChristmasCountdown.tsx": "Countdown timer component that calculates and displays days, hours, minutes, and seconds remaining until December 25th of the current year, updating every second.",
  "frontend/src/components/Footer.tsx": "Footer component displaying station description, quick navigation links, and social media icons (Facebook, X, Instagram) with a caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, nav links (including conditional Admin link), and Internet Identity login/logout button. Handles mobile menu toggle and active route highlighting.",
  "frontend/src/components/InitializeDJProfiles.tsx": "Headless component that runs once on mount to seed a default DJ profile ('Mark Huotari') if it doesn't exist and clears the now-playing state.",
  "frontend/src/components/LastPlayed.tsx": "Card component that embeds a Live365 iframe showing recently played songs for station a76054.",
  "frontend/src/components/Layout.tsx": "Root layout wrapping all pages with a theme-aware background image, decorative Christmas overlays, snowflakes, Header, Footer, and a router Outlet.",
  "frontend/src/components/NowPlaying.tsx": "Card displaying the currently playing song fetched from the backend, plus an embedded Live365 radio player iframe.",
  "frontend/src/components/OnAirDisplay.tsx": "Card that determines and displays the currently on-air program by matching the current day/time against the fetched schedule slots, with override support and Auto DJ fallback.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog that prompts newly authenticated users to enter their display name, then saves it via the backend mutation.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard that blocks access to children unless the user is authenticated and confirmed as an admin, showing appropriate login or access-denied UI otherwise.",
  "frontend/src/components/PublicWeatherForecast.tsx": "Displays a 7-day weather forecast for Duluth, MN by fetching data from the Open-Meteo API, showing weather icons, temperature ranges, and descriptions. Refreshes data every 24 hours and always uses Fahrenheit.",
  "frontend/src/components/RadioPlayer.tsx": "A radio player component with play/pause and volume controls that streams audio from a configured URL. Uses an HTML audio element ref and displays live broadcasting status.",
  "frontend/src/components/ScrollingBanner.tsx": "Renders a horizontally scrolling marquee banner promoting The Christmas Channel on Live365. Uses duplicated text spans for a continuous loop effect.",
  "frontend/src/components/Snowflakes.tsx": "Generates and renders animated falling snowflakes and randomly positioned twinkling colored lights as fixed full-screen overlays. Both sets of elements are created randomly on mount.",
  "frontend/src/components/UpcomingShows.tsx": "Fetches the program schedule and displays the next upcoming non-Auto-DJ shows with time-until labels, using day/time parsing logic to find the nearest future slots within a 7-day window.",
  "frontend/src/components/WaysToListen.tsx": "Displays a grid of listening method cards (website, Live365, Radioline, Online Radio Box, Get Me Radio) with icons, descriptions, and action buttons that open external links or scroll to the top.",
  "frontend/src/components/WeatherWidget.tsx": "An admin-facing 7-day weather widget for Duluth, MN that fetches from Open-Meteo and supports toggling between Fahrenheit and Celsius. Refreshes every 24 hours and re-fetches when the temperature unit changes.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) access, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider component and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data (DJ profiles, schedule, now playing, theme settings, user profiles, song requests, etc.) using the actor from useActor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines a Christmas-themed color palette with light/dark mode CSS variables, custom scrollbar styles, and a snowflake fall animation.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "About page displaying station information, a mission description, and a features grid with Christmas-themed styling, fetching dynamic station info via useGetStationInformation.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "The admin dashboard page showing a manual data-update trigger with last-update status, a weather widget, and a grid of navigation cards linking to various station management sections.",
  "frontend/src/pages/admin/ManageDJs.tsx": "An admin page for creating, editing, and deleting DJ profiles, including image file upload with progress tracking, using dialog forms and the DJ profile query hooks.",
  "frontend/src/pages/admin/ManageNowPlaying.tsx": "Admin page for updating or clearing the currently playing song, with a form for title and artist fields backed by React Query mutations.",
  "frontend/src/pages/admin/ManageOnAir.tsx": "Admin page to manually set or clear an 'On Air' display override, specifying a show name, description, and duration in hours.",
  "frontend/src/pages/admin/ManagePrograms.tsx": "Admin page for managing the program schedule, supporting add, edit, and delete operations on program day slots via a dialog form.",
  "frontend/src/pages/admin/ManageSongRequests.tsx": "Admin page that displays incoming listener song requests in a table and allows bulk deletion of all requests with a confirmation dialog.",
  "frontend/src/pages/admin/ManageStationInfo.tsx": "Admin page for editing the station's About section, with fields for title, description, and content, saved via a React Query mutation.",
  "frontend/src/pages/admin/ManageThemeSettings.tsx": "Admin page component for managing site theme settings including background image, primary/accent colors, snow effect, countdown, and news feed toggles, with save and preview functionality.",
  "frontend/src/pages/DJsPage.tsx": "DJs page that fetches and displays DJ profiles in a responsive grid with photos and bios, showing skeleton loaders while loading and an empty state if no DJs exist.",
  "frontend/src/pages/HomePage.tsx": "The main public-facing home page that composes the radio player, now playing, last played, on-air display, upcoming shows, weather forecast, ways to listen, and quick-link cards into a single Christmas-themed layout.",
  "frontend/src/pages/RequestsPage.tsx": "A page with a form allowing listeners to submit song requests (name, song title, optional message) via the useSubmitSongRequest mutation, with toast feedback on success or failure.",
  "frontend/src/pages/SchedulePage.tsx": "Displays the weekly program schedule grouped and sorted by day, with color-coded day cards, quick-nav pills, today highlighting, and loading skeletons while data is fetched.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence helpers and a function to remove sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens (using oklch), border radius, box shadows, keyframe animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state tracking file for the Christmas Channel Radio app, recording existing features, pending feature requests, and architectural notes related to adding a bio/description field to shows."
}