{
  "kind": "build_request",
  "title": "Add bio/description field to each program/show in the schedule",
  "projectName": "Christmas Channel Radio",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a `bio` (or `description`) text field to the Program data type in the backend so each show can store a bio/description string.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "also add each bio to each show"
        ]
      },
      "acceptanceCriteria": [
        "The Program (or ProgramDaySlot) type in backend/main.mo includes a `bio` field of type Text.",
        "Existing create/update endpoints for programs accept and persist the bio field.",
        "Query endpoints for programs return the bio field.",
        "Existing programs without a bio default to an empty string."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the ManagePrograms admin page to include a bio/description input field in the add/edit program dialog form, allowing admins to enter and save a bio for each show.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "also add each bio to each show"
        ]
      },
      "acceptanceCriteria": [
        "The add/edit dialog in ManagePrograms includes a textarea or text input labeled 'Bio' or 'Description'.",
        "The bio value is submitted with the rest of the program form data.",
        "When editing an existing program, the bio field is pre-populated with the current bio value.",
        "The bio field is optional (not required to save a program)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Display each show's bio on the public SchedulePage, shown beneath or alongside the show name/time for programs that have a bio entered.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "also add each bio to each show"
        ]
      },
      "acceptanceCriteria": [
        "Shows with a non-empty bio display the bio text on the SchedulePage.",
        "Shows without a bio do not show an empty bio section.",
        "Bio text is styled consistently with the existing schedule card design."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Display each show's bio in the UpcomingShows component when a show has a bio, shown beneath the show name.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "also add each bio to each show"
        ]
      },
      "acceptanceCriteria": [
        "Upcoming show cards display the bio if one exists.",
        "Cards without a bio are unaffected in layout.",
        "Bio text does not overflow or break the card layout."
      ]
    }
  ],
  "constraints": [
    "Do not break existing program schedule data or the weekday slot structure introduced in previous versions.",
    "The bio field must be optional and backward-compatible with existing stored programs."
  ],
  "nonGoals": [
    "Adding bios to DJ profiles (already a separate feature on the DJs page).",
    "Rich text / HTML formatting for bios — plain text only.",
    "Adding bios to song requests or other non-program entities."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}