{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add bio/description field to each program/show in the schedule",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Update the ManagePrograms admin page to include a bio/description input field in the add/edit program dialog form, allowing admins to enter and save a bio for each show.",
      "acceptanceCriteria": [
        "The add/edit dialog in ManagePrograms includes a textarea or text input labeled 'Bio' or 'Description'.",
        "The bio value is submitted with the rest of the program form data.",
        "When editing an existing program, the bio field is pre-populated with the current bio value.",
        "The bio field is optional (not required to save a program)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/ManagePrograms.tsx",
          "operation": "modify",
          "description": "Add a bio/description textarea field to the add/edit program dialog form. Include the bio field in the form state alongside name, description, startTime, and endTime. When editing an existing program, pre-populate the bio field with the current program.bio value. Submit the bio value with addCustomProgram and updateProgram backend calls. The bio field is optional and can be left empty."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display each show's bio on the public SchedulePage, shown beneath or alongside the show name/time for programs that have a bio entered.",
      "acceptanceCriteria": [
        "Shows with a non-empty bio display the bio text on the SchedulePage.",
        "Shows without a bio do not show an empty bio section.",
        "Bio text is styled consistently with the existing schedule card design."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SchedulePage.tsx",
          "operation": "modify",
          "description": "Display each program's bio field beneath the program name and time slot if the bio is non-empty. Conditionally render the bio text only when program.bio exists and is not an empty string. Style the bio text consistently with the existing schedule card typography and spacing, ensuring it fits within the card layout without breaking visual hierarchy."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Display each show's bio in the UpcomingShows component when a show has a bio, shown beneath the show name.",
      "acceptanceCriteria": [
        "Upcoming show cards display the bio if one exists.",
        "Cards without a bio are unaffected in layout.",
        "Bio text does not overflow or break the card layout."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/UpcomingShows.tsx",
          "operation": "modify",
          "description": "Display the program's bio field beneath the program name in each upcoming show card when program.bio is non-empty. Conditionally render the bio text to avoid showing empty sections. Ensure the bio text is styled consistently with the card design and does not cause layout overflow or break the card structure."
        }
      ]
    }
  ]
}