{
  "backend/main.mo": "Main Motoko actor defining all backend types (DJProfile, Program, NowPlaying, ThemeSettings, WeatherData, SongRequest, OnAirOverride, StationInformation) and stable storage maps for DJ profiles, program schedules, theme settings, song requests, weather data, on-air overrides, and station information with CRUD query/update functions and authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features for station information management: About Station section on About page, admin management page, React Query hooks, and navigation link from admin dashboard.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including React components, pages, hooks, routing, styling, and configuration with details on station information display, admin management, theme settings, DJ profiles, program schedules, and Christmas-themed UI elements.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script import for main.tsx.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with routes for all pages (home, schedule, DJs, requests, about) and admin pages (dashboard, manage DJs/programs/now-playing/theme/song-requests/on-air/station-info), QueryClient setup, ThemeProvider, and Layout wrapper with ProfileSetup and InitializeDJProfiles components.",
  "frontend/src/components/ChristmasCountdown.tsx": "Christmas countdown timer component displaying days, hours, minutes, and seconds remaining until December 25th of the current year with festive styling, snowflake icons, and real-time updates.",
  "frontend/src/components/Footer.tsx": "Footer component with three columns displaying station info, quick navigation links, social media icons (Facebook, X, Instagram), and copyright notice with caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Navigation header component with logo, menu items (Home, Schedule, DJs, Requests, About, Admin), mobile menu toggle, and Internet Identity login/logout functionality. Conditionally shows Admin link for admin users and handles authentication state.",
  "frontend/src/components/InitializeDJProfiles.tsx": "Initialization component that runs once on mount to add a default DJ profile for 'Mark Huotari' if it doesn't exist and clears the now playing song. Renders nothing visible.",
  "frontend/src/components/LastPlayed.tsx": "Displays recently played songs using an embedded Live365 iframe player with a decorative card layout featuring a history icon and Christmas-themed styling.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper that provides the page structure with Header, Footer, optional Snowflakes, and dynamic background image based on theme settings. Includes decorative Christmas elements like garlands and ornaments.",
  "frontend/src/components/NowPlaying.tsx": "Displays the currently playing song information (title and artist) with an embedded Live365 radio player iframe. Shows loading skeletons while fetching data.",
  "frontend/src/components/OnAirDisplay.tsx": "Shows the current on-air DJ and program by matching the current time against the program schedule, with support for time ranges, day matching (including weekdays/weekends/daily), and manual on-air overrides. Includes complex time parsing and range checking logic.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name. Automatically opens when needed and saves the profile to the backend.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that checks authentication and admin status, displaying appropriate login prompts or access denied messages for non-admin users trying to access protected routes.",
  "frontend/src/components/PublicWeatherForecast.tsx": "Displays a 7-day weather forecast for Duluth using the Open-Meteo API with weather icons, temperature ranges, and descriptions. Fetches data on mount and refreshes every 24 hours.",
  "frontend/src/components/RadioPlayer.tsx": "Audio player component with play/pause controls, volume slider, and mute functionality for streaming a Christmas radio station. Uses a placeholder stream URL that needs to be replaced.",
  "frontend/src/components/ScrollingBanner.tsx": "Displays a horizontally scrolling marquee banner with Christmas-themed styling promoting the Live365-powered radio station.",
  "frontend/src/components/Snowflakes.tsx": "Renders animated snowflakes and twinkling Christmas lights as decorative overlay effects across the page. Generates 80 snowflakes and 40 colored lights with randomized positions and animation timings.",
  "frontend/src/components/UpcomingShows.tsx": "Displays upcoming live radio shows by parsing program schedules, calculating time until next shows, and filtering out Auto DJ entries. Handles various day formats (daily, weekdays, weekends, day ranges) and time parsing.",
  "frontend/src/components/WaysToListen.tsx": "Grid of cards showing different platforms to listen to the radio station (website, Live365, Radioline, Online Radio Box, Get Me Radio) with icons, descriptions, and action buttons.",
  "frontend/src/components/WeatherWidget.tsx": "Weather widget for Duluth showing 7-day forecast with temperature unit toggle (Fahrenheit/Celsius), weather icons, and descriptions. Fetches from Open-Meteo API and refreshes daily.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout state, creating auth clients with configurable options, and handling identity delegation with automatic state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including DJ profiles, program schedules, now playing info, theme settings, user profiles, song requests, and station information with appropriate refetch intervals.",
  "frontend/src/index.css": "Tailwind CSS configuration with Christmas-themed color variables (red, green, gold) in OKLCH color space for both light and dark modes, plus base styling for the application.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Displays station information including logo, description, mission statement, and features grid showcasing The Christmas Channel's offerings with loading states.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Protected admin dashboard providing navigation cards to manage DJs, schedule, now playing, requests, theme settings, and weather. Includes manual update trigger button with status display showing last update result and timestamp.",
  "frontend/src/pages/admin/ManageDJs.tsx": "Protected admin page for CRUD operations on DJ profiles including name, bio, and photo upload with progress tracking. Uses dialog modals for add/edit forms and delete confirmation.",
  "frontend/src/pages/admin/ManageNowPlaying.tsx": "Protected admin page for updating the currently playing song information (title and artist) in real-time, with ability to clear the current song. Form pre-populates with existing data.",
  "frontend/src/pages/admin/ManageOnAir.tsx": "Admin page for manually overriding the public On Air display with custom show name, description, and duration. Includes form validation, status display, and ability to save or clear overrides.",
  "frontend/src/pages/admin/ManagePrograms.tsx": "Admin page for managing radio program schedules with CRUD operations (add, edit, delete). Features dialog forms for program details including name, description, start/end times.",
  "frontend/src/pages/admin/ManageSongRequests.tsx": "Admin page displaying incoming listener song requests in a table with ability to clear all requests. Includes loading states and empty state handling.",
  "frontend/src/pages/admin/ManageStationInfo.tsx": "Admin page for editing station information including title, description, and content for the About Station section. Features a form with text inputs and textarea.",
  "frontend/src/pages/admin/ManageThemeSettings.tsx": "Admin page for customizing theme settings including countdown visibility, snow effects, background images, and color schemes. Includes preview mode and save functionality.",
  "frontend/src/pages/DJsPage.tsx": "Renders a grid of DJ profile cards with photos, names, and bios, fetched from the backend with loading skeletons and empty state handling.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying hero banner, live radio player, now playing info, last played tracks, on-air display, upcoming shows, weather forecast, ways to listen, and quick links to schedule, DJs, and requests. Conditionally renders Christmas countdown based on theme settings.",
  "frontend/src/pages/RequestsPage.tsx": "Public-facing song request form page where listeners can submit their name, song title, and optional message. Uses mutation hook to submit requests and displays toast notifications on success or failure.",
  "frontend/src/pages/SchedulePage.tsx": "Displays the daily program schedule with time slots, show names, and descriptions. Shows loading skeletons while fetching data and an empty state when no programs are scheduled.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, including theme colors, Christmas-themed colors, sidebar colors, and extended utilities for borders, shadows, and animations.",
  "project_state.json": "Project state tracking file for Christmas Channel Radio application documenting existing features for station information management (About page, admin page, React Query hooks) and pending backend requirements for data storage and mutations."
}